{
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.1,
  "dtype": "float32",
  "head_dim": 32,
  "hidden_act": "silu",
  "hidden_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 1512,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 252,
  "max_window_layers": null,
  "model_type": "qwen3",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_key_value_heads": 6,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "4.56.1",
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 19482
}
